In [2]:
import sqlite3
import pandas as pd

In [3]:
def tabelas_bd():
    conn = sqlite3.connect("coderhouse.db")
    query = "SELECT name FROM sqlite_master WHERE type='table'"
    schema = pd.read_sql(query, conn)
    conn.close()
    
    return schema
    
def salva_bd(df, nome_tabela):
    conn = sqlite3.connect("coderhouse.db")
    salva_df = df.to_sql(nome_tabela, conn, if_exists='replace', index=False)
    conn.close()

    return True

def carrega_bd(nome_tabela):
    conn = sqlite3.connect('coderhouse.db')
    query = f"SELECT * FROM {nome_tabela}"
    df_query = pd.read_sql(query, conn)
    conn.close()

    return df_query

In [6]:
tabelas_bd()

       name
0  fastfood
1  produtos
2   VASCUDO
3    MINGAU